"""
2. Написати скрипт, який пройдеться по списку, який складається із кортежів, і замінить для кожного
   кортежа останнє значення.
   Список із кортежів можна захардкодити. Значення, на яке замінюється останній елемент кортежа
   вводиться користувачем.
   Значення, введене користувачем, можна ніяк не конвертувати (залишити рядком). Кількість елементів
   в кортежу повинна бути різна.
             Приклад списка котежів: [(10, 20, 40), (40, 50, 60, 70), (80, 90), (1000,)]
             Очікуваний результат, якщо введено "100":
        Expected Output: [(10, 20, "100"), (40, 50, 60, "100"), (80, "100"), ("100",)]
"""


value = input('Enter a value:')
first_list = [(10, 20, 40), (40, 50, 60, 70), (80, 90), (1000,)]
last_list = []
for tuple_i in first_list:
    tuple_i_list = list(tuple_i)
    tuple_i_list[-1] = value
    tuple_i = tuple(tuple_i_list)
    last_list.append(tuple_i)
print(last_list)
