"""
5. Написати скрипт, який залишить в словнику тільки пари із унікальними значеннями (дублікати значень - видалити).
   Словник для роботи захардкодити свій.
                Приклад словника (не використовувати):
                {'a': 1, 'b': 3, 'c': 1, 'd': 5}
                Очікуваний результат:
                {'a': 1, 'b': 3, 'd': 5}
"""

first_dict = {'t': 1, 'r': 2, 's': 1, 'k': 2, 'b': 1, 'x': 3}
last_dict = {}
for key, value in first_dict.items():
    if value not in last_dict.values():
        last_dict[key] = value
print(last_dict)
