"""
3. Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
   На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
   Кількість символів в блоках - та, яка введена в другому параметрі.
   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі (наприклад,
   файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?)
   В репозиторій додайте і ті файли, по яким робили тести.
   Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл,
   а отримане "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість.
   В разі необхідності заокруглення одного чи обох параметрів - дивіться на свій розсуд.
   Наприклад:
   █ █ █ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ ░ █ █ █    - правильно
                     ⏫ центр
   █ █ █ ░ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ █ █ █    - неправильно
                     ⏫ центр
"""


def list_block(filename, number):
    try:
        my_list = []
        with open(filename, 'r') as file:
            text_1 = file.read(number)
            my_list.append(text_1)

        with open(filename, 'r') as file:
            file.seek(len(file.read()) // 2 - number // 2)
            text_2 = file.read(number)
            my_list.append(text_2)

        with open(filename, 'r') as file:
            line = len(file.read()) - number
            file.seek(line)
            text_3 = file.read(number)
            my_list.append(text_3)

        return my_list

    except ValueError:
        return "Число більше ніж довжина рядка"


print(list_block("2.txt", 7))
